МДК.01.02 "Прикладное программирование"
ЛЗ 9. Разработка программ со строками
Составитель: Гусятинер Л.Б., 25.04.2020, МГОТУ ККМТ, П1-17, П2-17

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?
        Конструктор, который может быть вызван без аргументов
2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.
        string s1; - стандартный конструктор
        string s2(s1); - инициализация строки s2 как копии строки s1
        string s3("value"); - инициализация строки s3 как копии строкового литерала
        string s4(n, 'c'); - инициализация строки s4 последовательностью из n символов c

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s;
int main()
{
        string s2;
}
Ответ:
        s1, s2 пустые строки.

[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки.
Измените программу так, чтобы она читала отдельные слова.

Ответ:
        Целые строки - файл step4.1.cpp
        Только слова - файл step4.2.cpp

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных
в строковую переменную, когда используется функция getline().

Ответ:
        Строка читается целиком, с пробелами и прочими символами до знака перевода строки.
        И не игнорирует предваряющие пробелы

[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они,
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки
одинаковую длину, и если нет, то какая из них длинней.

Ответ: файл step.6.cpp

7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы
отделить соседние введенные строки пробелами.

Ответ: файл step.7.cpp

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;

Ответ:
         Допустимо, выведется 0 символ строки, но так как строка пустая, ничего не выведется

9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации.
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации,
и вывести ту же строку, но уже без знаков пунктуации.

Ответ: файл Step9.cpp

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

Ответ: файл Step10.cpp
