Гришаев А., П2-17
Упражнения раздела 3.2.1

Упражнение 3.2. Что такое стандартный конструктор?

Ответ: Автоматически создаваемый конструктор, если конструктор не был объявлен в классе.


Упражнение 3.3. Назовите три способа инициализации объекта класса string.

Ответ:
string s1 = "hi";
string s2(s1);
string s3("value");


Упражнение 3.4. Каковы значения переменных s и s2?

string s; 
int main() 
{ 
    string s2;
}
Ответ: пустые строки.


Упражнения раздела 3.2.2

Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

Ответ:
#include <iostream>
#include <string>

using namespace std
int main()
{
    string str;
    getline(cin, str);
    return 0;
}


Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

Ответ:
Функция getline() записывает весь ввод, включая пробелы.


Упражнения раздела 3.2.4

Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки одинаковую длину, и если нет, то какая из них длинней.

Ответ:
-


Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы отделить соседние введенные строки пробелами.

Ответ:
#include <iostream>
#include <string>

using namespace std

int main()
{
    string str, res;

    while (getline(cin, str))
    {
        res += (str + ' ');
        cout << "Result: " << res << endl;
    }

    return 0;
}


Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?

string s;
cout << s[0] << endl;

Ответ: Программа ничего не выведет, строка пустая.


Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, и вывести ту же строку, но уже без знаков пунктуации.

Ответ:
#include <iostream>
#include <string>

using namespace std

int main()
{
    string str;
    getline(cin, str);

    for (int i = 0; i != str.size(); ++i)
    {
        if (!ispunct(str[i]))
            cout << str[i];
    }

    return 0;
}

