[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?

______Ответ: автоматически вызываемый конструктор (если программист не объявил свой)
2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.

______Ответ: 
string str;
string str("stroka");
string str(str2);
3) Упражнение 3.4. Каковы значения переменных s и s2?

______Ответ: пустые строки, зато s - глобальная
string s; 
int main() { 
	string s2;
}

[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

______Ответ: getline() "ест" всё, в том числе и пробелы

[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.

______Ответ:
#include <iostream>
#include <string>

using namespace std;

int main()
{
	string str1, str2;
	cin >> str1 >> str2;
	if (str1.size() == str2.size())
        		cout << "Equal";
    	else if (str1.size() > str2.size())
       		 cout << "First";
   	 else
       		 cout << "Second";
	return 0;
}

7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.

______Ответ:
#include <iostream>
#include <string>

using namespace std;

int main()
{
	string str, a;
	while(getline(cin, str))
    	{
        		a += (str + ' ');
        		cout << a << " " << endl;
    	}
	return 0;
}

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;

______Ответ: допустима, но ничего не выведется, так как строка пустая

9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.

______Ответ:
#include <iostream>
#include <string>

using namespace std;

int main()
{
    string str;
    getline(cin, str);
    for(int i = 0; i != str.size(); i++)
        if(!ispunct(str[i]))
            cout << str[i];
    return 0;
}

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

______Ответ:
#include <iostream>
#include <string>
#include <fstream>

using namespace std;

int main()
{
    ifstream f("Input.txt");
    ofstream f2("Output.txt");
    string str;
    getline(f, str);
    for(int i = 0; i != str.size(); i++)
        if(!ispunct(str[i]))
            f2 << str[i];
    f.close();
    f2.close();
    return 0;
}